Revit 2027 API
CurveElement.GetTangentLock Method
 Returns the state of a tangent join between this and another curve element at the given end-point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetTangentLock(
	int end,
	ElementId other
)
Public Function GetTangentLock (
	end As Integer,
	other As ElementId
) As Boolean
public:
bool GetTangentLock(
	int end,
	ElementId^ other
)
member GetTangentLock :
        end : int *
        other : ElementId -> bool
Parameters
end Int32
 Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other ElementId
 ElementId of another Curve Element from the same document.
Return Value
Boolean
 Returns True if this curve element has a tangent joint with the other input element and the join is curently locked; returns False otherwise.
Exceptions
Exception | Condition
ArgumentException |  The given Id does not represent any of the two end-points of a curve element. A valid value of either '0' or '1' is expected. -or- The given ElementId (%elementId) is not of a valid Curve Element. A valid Curve Element must be in the same document and must be diferent than this curve elements self. -or- This element has no tangent join with the input element at the given end-point.
ArgumentNullException |  A non-optional argument was null
Remarks
 The return value indicates whether there is such tangent join and if it is currently locked. A negative value indicates that there either is no tangent join with the other element at the given end-point, or the join between those two curve element is not currently locked.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace